Revit 2027 API
ScheduleDefinition.ClearSortGroupFields Method
 Removes all sorting/grouping fields.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearSortGroupFields()
Public Sub ClearSortGroupFields
public:
void ClearSortGroupFields()
member ClearSortGroupFields : unit -> unit
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace